---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtainGridBaseOrientation
source: html/4e8c727c-1525-e02d-0875-d9a154f51f25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtainGridBaseOrientation Property

"Grid Base Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtainGridBaseOrientation { get; }
```